# ДЗ №5
# 1. Установить в свою виртуальную среду проекта внешний модуль python-decouple

# from decouple import config


# 2. В файле requirements.txt зафиксировать зависимости проекта с помощью команды pip freeze

# 3. Создать многомодульную игру Казино
print("Добро пожаловать в игру казино!")
import logic 
import player 




